AdrianoRuseler/LAUNCHXL-F28379D/C2000Ware/common/deprecated/inc/hw_epwm.h
//###########################################################################
//
// FILE:    hw_epwm.h
//
// TITLE:   Definitions for the C28x EPWM registers.
//
//###########################################################################
// $TI Release: F2837xD Support Library v3.04.00.00 $
// $Release Date: Sun Mar 25 13:26:04 CDT 2018 $
// $Copyright:
// Copyright (C) 2013-2018 Texas Instruments Incorporated - http://www.ti.com/
//
// Redistribution and use in source and binary forms, with or without 
// modification, are permitted provided that the following conditions 
// are met:
// 
//   Redistributions of source code must retain the above copyright 
//   notice, this list of conditions and the following disclaimer.
// 
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the 
//   documentation and/or other materials provided with the   
//   distribution.
// 
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
// 
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// $
//###########################################################################

#ifndef __HW_EPWM_H__
#define __HW_EPWM_H__

//*****************************************************************************
//
// The following are defines for the EPWM register offsets
//
//*****************************************************************************
#define EPWM_O_TBCTL              0x0         // Time Base Control Register
#define EPWM_O_TBCTL2             0x1         // Time Base Control Register 2
#define EPWM_O_TBCTR              0x4         // Time Base Counter Register
#define EPWM_O_TBSTS              0x5         // Time Base Status Register
#define EPWM_O_CMPCTL             0x8         // Counter Compare Control
                                              // Register
#define EPWM_O_CMPCTL2            0x9         // Counter Compare Control
                                              // Register 2
#define EPWM_O_DBCTL              0xC         // Dead-Band Generator Control
                                              // Register
#define EPWM_O_DBCTL2             0xD         // Dead-Band Generator Control
                                              // Register 2
#define EPWM_O_AQCTL              0x10        // Action Qualifier Control
                                              // Register
#define EPWM_O_AQTSRCSEL          0x11        // Action Qualifier Trigger Event
                                              // Source Select Register
#define EPWM_O_PCCTL              0x14        // PWM Chopper Control Register
#define EPWM_O_HRCNFG             0x20        // HRPWM Configuration Register
#define EPWM_O_HRPWR              0x21        // HRPWM Power Register
#define EPWM_O_HRMSTEP            0x26        // HRPWM MEP Step Register
#define EPWM_O_HRPCTL             0x2D        // High Resolution Period Control
                                              // Register
#define EPWM_O_GLDCTL             0x34        // Global PWM Load Control
                                              // Register
#define EPWM_O_GLDCFG             0x35        // Global PWM Load Config Register
#define EPWM_O_XLINK              0x38        // EPWMx Link Register
#define EPWM_O_AQCTLA             0x40        // Action Qualifier Control
                                              // Register For Output A
#define EPWM_O_AQCTLA2            0x41        // Additional Action Qualifier
                                              // Control Register For Output A
#define EPWM_O_AQCTLB             0x42        // Action Qualifier Control
                                              // Register For Output B
#define EPWM_O_AQCTLB2            0x43        // Additional Action Qualifier
                                              // Control Register For Output B
#define EPWM_O_AQSFRC             0x47        // Action Qualifier Software Force
                                              // Register
#define EPWM_O_AQCSFRC            0x49        // Action Qualifier Continuous S/W
                                              // Force Register
#define EPWM_O_DBREDHR            0x50        // Dead-Band Generator Rising Edge
                                              // Delay High Resolution Mirror
                                              // Register
#define EPWM_O_DBRED              0x51        // Dead-Band Generator Rising Edge
                                              // Delay High Resolution Mirror
                                              // Register
#define EPWM_O_DBFEDHR            0x52        // Dead-Band Generator Falling
                                              // Edge Delay High Resolution
                                              // Register
#define EPWM_O_DBFED              0x53        // Dead-Band Generator Falling
                                              // Edge Delay Count Register
#define EPWM_O_TBPHS              0x60        // Time Base Phase High
#define EPWM_O_TBPRDHR            0x62        // Time Base Period High
                                              // Resolution Register
#define EPWM_O_TBPRD              0x63        // Time Base Period Register
#define EPWM_O_CMPA               0x6A        // Counter Compare A Register
#define EPWM_O_CMPB               0x6C        // Compare B Register
#define EPWM_O_CMPC               0x6F        // Counter Compare C Register
#define EPWM_O_CMPD               0x71        // Counter Compare D Register
#define EPWM_O_GLDCTL2            0x74        // Global PWM Load Control
                                              // Register 2
#define EPWM_O_TZSEL              0x80        // Trip Zone Select Register
#define EPWM_O_TZDCSEL            0x82        // Trip Zone Digital Comparator
                                              // Select Register
#define EPWM_O_TZCTL              0x84        // Trip Zone Control Register
#define EPWM_O_TZCTL2             0x85        // Additional Trip Zone Control
                                              // Register
#define EPWM_O_TZCTLDCA           0x86        // Trip Zone Control Register
                                              // Digital Compare A
#define EPWM_O_TZCTLDCB           0x87        // Trip Zone Control Register
                                              // Digital Compare B
#define EPWM_O_TZEINT             0x8D        // Trip Zone Enable Interrupt
                                              // Register
#define EPWM_O_TZFLG              0x93        // Trip Zone Flag Register
#define EPWM_O_TZCBCFLG           0x94        // Trip Zone CBC Flag Register
#define EPWM_O_TZOSTFLG           0x95        // Trip Zone OST Flag Register
#define EPWM_O_TZCLR              0x97        // Trip Zone Clear Register
#define EPWM_O_TZCBCCLR           0x98        // Trip Zone CBC Clear Register
#define EPWM_O_TZOSTCLR           0x99        // Trip Zone OST Clear Register
#define EPWM_O_TZFRC              0x9B        // Trip Zone Force Register
#define EPWM_O_ETSEL              0xA4        // Event Trigger Selection
                                              // Register
#define EPWM_O_ETPS               0xA6        // Event Trigger Pre-Scale
                                              // Register
#define EPWM_O_ETFLG              0xA8        // Event Trigger Flag Register
#define EPWM_O_ETCLR              0xAA        // Event Trigger Clear Register
#define EPWM_O_ETFRC              0xAC        // Event Trigger Force Register
#define EPWM_O_ETINTPS            0xAE        // Event-Trigger Interrupt
                                              // Pre-Scale Register
#define EPWM_O_ETSOCPS            0xB0        // Event-Trigger SOC Pre-Scale
                                              // Register
#define EPWM_O_ETCNTINITCTL       0xB2        // Event-Trigger Counter
                                              // Initialization Control
                                              // Register
#define EPWM_O_ETCNTINIT          0xB4        // Event-Trigger Counter
                                              // Initialization Register
#define EPWM_O_DCTRIPSEL          0xC0        // Digital Compare Trip Select
                                              // Register
#define EPWM_O_DCACTL             0xC3        // Digital Compare A Control
                                              // Register
#define EPWM_O_DCBCTL             0xC4        // Digital Compare B Control
                                              // Register
#define EPWM_O_DCFCTL             0xC7        // Digital Compare Filter Control
                                              // Register
#define EPWM_O_DCCAPCTL           0xC8        // Digital Compare Capture Control
                                              // Register
#define EPWM_O_DCFOFFSET          0xC9        // Digital Compare Filter Offset
                                              // Register
#define EPWM_O_DCFOFFSETCNT       0xCA        // Digital Compare Filter Offset
                                              // Counter Register
#define EPWM_O_DCFWINDOW          0xCB        // Digital Compare Filter Window
                                              // Register
#define EPWM_O_DCFWINDOWCNT       0xCC        // Digital Compare Filter Window
                                              // Counter Register
#define EPWM_O_DCCAP              0xCF        // Digital Compare Counter Capture
                                              // Register
#define EPWM_O_DCAHTRIPSEL        0xD2        // Digital Compare AH Trip Select
#define EPWM_O_DCALTRIPSEL        0xD3        // Digital Compare AL Trip Select
#define EPWM_O_DCBHTRIPSEL        0xD4        // Digital Compare BH Trip Select
#define EPWM_O_DCBLTRIPSEL        0xD5        // Digital Compare BL Trip Select

//*****************************************************************************
//
// The following are defines for the bit fields in the TBCTL register
//
//*****************************************************************************
#define EPWM_TBCTL_CTRMODE_S      0
#define EPWM_TBCTL_CTRMODE_M      0x3         // Counter Mode
#define EPWM_TBCTL_PHSEN          0x4         // Phase Load Enable
#define EPWM_TBCTL_PRDLD          0x8         // Active Period Load
#define EPWM_TBCTL_SYNCOSEL_S     4
#define EPWM_TBCTL_SYNCOSEL_M     0x30        // Sync Output Select
#define EPWM_TBCTL_SWFSYNC        0x40        // Software Force Sync Pulse
#define EPWM_TBCTL_HSPCLKDIV_S    7
#define EPWM_TBCTL_HSPCLKDIV_M    0x380       // High Speed TBCLK Pre-scaler
#define EPWM_TBCTL_CLKDIV_S       10
#define EPWM_TBCTL_CLKDIV_M       0x1C00      // Time Base Clock Pre-scaler
#define EPWM_TBCTL_PHSDIR         0x2000      // Phase Direction Bit
#define EPWM_TBCTL_FREE_SOFT_S    14
#define EPWM_TBCTL_FREE_SOFT_M    0xC000      // Emulation Mode Bits

//*****************************************************************************
//
// The following are defines for the bit fields in the TBCTL2 register
//
//*****************************************************************************
#define EPWM_TBCTL2_SELFCLRTRREM  0x20        // Self clear Translator reminder
#define EPWM_TBCTL2_OSHTSYNCMODE  0x40        // One shot sync mode
#define EPWM_TBCTL2_OSHTSYNC      0x80        // One shot sync
#define EPWM_TBCTL2_SYNCOSELX_S   12
#define EPWM_TBCTL2_SYNCOSELX_M   0x3000      // Syncout selection
#define EPWM_TBCTL2_PRDLDSYNC_S   14
#define EPWM_TBCTL2_PRDLDSYNC_M   0xC000      // PRD Shadow to Active Load on
                                              // SYNC Event

//*****************************************************************************
//
// The following are defines for the bit fields in the TBCTR register
//
//*****************************************************************************
#define EPWM_TBCTR_TBCTR_S        0
#define EPWM_TBCTR_TBCTR_M        0xFFFF      // Counter Value

//*****************************************************************************
//
// The following are defines for the bit fields in the TBSTS register
//
//*****************************************************************************
#define EPWM_TBSTS_CTRDIR         0x1         // Counter Direction Status
#define EPWM_TBSTS_SYNCI          0x2         // External Input Sync Status
#define EPWM_TBSTS_CTRMAX         0x4         // Counter Max Latched Status

//*****************************************************************************
//
// The following are defines for the bit fields in the CMPCTL register
//
//*****************************************************************************
#define EPWM_CMPCTL_LOADAMODE_S   0
#define EPWM_CMPCTL_LOADAMODE_M   0x3         // Active Compare A Load
#define EPWM_CMPCTL_LOADBMODE_S   2
#define EPWM_CMPCTL_LOADBMODE_M   0xC         // Active Compare B Load
#define EPWM_CMPCTL_SHDWAMODE     0x10        // Compare A Register Block
                                              // Operating Mode
#define EPWM_CMPCTL_SHDWBMODE     0x40        // Compare B Register Block
                                              // Operating Mode
#define EPWM_CMPCTL_SHDWAFULL     0x100       // Compare A Shadow Register Full
                                              // Status
#define EPWM_CMPCTL_SHDWBFULL     0x200       // Compare B Shadow Register Full
                                              // Status
#define EPWM_CMPCTL_LOADASYNC_S   10
#define EPWM_CMPCTL_LOADASYNC_M   0xC00       // Active Compare A Load on SYNC
#define EPWM_CMPCTL_LOADBSYNC_S   12
#define EPWM_CMPCTL_LOADBSYNC_M   0x3000      // Active Compare B Load on SYNC

//*****************************************************************************
//
// The following are defines for the bit fields in the CMPCTL2 register
//
//*****************************************************************************
#define EPWM_CMPCTL2_LOADCMODE_S  0
#define EPWM_CMPCTL2_LOADCMODE_M  0x3         // Active Compare C Load
#define EPWM_CMPCTL2_LOADDMODE_S  2
#define EPWM_CMPCTL2_LOADDMODE_M  0xC         // Active Compare D load
#define EPWM_CMPCTL2_SHDWCMODE    0x10        // Compare C Block Operating Mode
#define EPWM_CMPCTL2_SHDWDMODE    0x40        // Compare D Block Operating Mode
#define EPWM_CMPCTL2_LOADCSYNC_S  10
#define EPWM_CMPCTL2_LOADCSYNC_M  0xC00       // Active Compare C Load on SYNC
#define EPWM_CMPCTL2_LOADDSYNC_S  12
#define EPWM_CMPCTL2_LOADDSYNC_M  0x3000      // Active Compare D Load on SYNC

//*****************************************************************************
//
// The following are defines for the bit fields in the DBCTL register
//
//*****************************************************************************
#define EPWM_DBCTL_OUT_MODE_S     0
#define EPWM_DBCTL_OUT_MODE_M     0x3         // Dead Band Output Mode Control
#define EPWM_DBCTL_POLSEL_S       2
#define EPWM_DBCTL_POLSEL_M       0xC         // Polarity Select Control
#define EPWM_DBCTL_IN_MODE_S      4
#define EPWM_DBCTL_IN_MODE_M      0x30        // Dead Band Input Select Mode
                                              // Control
#define EPWM_DBCTL_LOADREDMODE_S  6
#define EPWM_DBCTL_LOADREDMODE_M  0xC0        // Active DBRED Load Mode
#define EPWM_DBCTL_LOADFEDMODE_S  8
#define EPWM_DBCTL_LOADFEDMODE_M  0x300       // Active DBFED Load Mode
#define EPWM_DBCTL_SHDWDBREDMODE  0x400       // DBRED Block Operating Mode
#define EPWM_DBCTL_SHDWDBFEDMODE  0x800       // DBFED Block Operating Mode
#define EPWM_DBCTL_OUTSWAP_S      12
#define EPWM_DBCTL_OUTSWAP_M      0x3000      // Dead Band Output Swap Control
#define EPWM_DBCTL_DEDB_MODE      0x4000      // Dead Band Dual-Edge B Mode
                                              // Control
#define EPWM_DBCTL_HALFCYCLE      0x8000      // Half Cycle Clocking Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the DBCTL2 register
//
//*****************************************************************************
#define EPWM_DBCTL2_LOADDBCTLMODE_S  0
#define EPWM_DBCTL2_LOADDBCTLMODE_M  0x3         // DBCTL Load from Shadow Mode
                                              // Select
#define EPWM_DBCTL2_SHDWDBCTLMODE  0x4         // DBCTL Load mode Select

//*****************************************************************************
//
// The following are defines for the bit fields in the AQCTL register
//
//*****************************************************************************
#define EPWM_AQCTL_LDAQAMODE_S    0
#define EPWM_AQCTL_LDAQAMODE_M    0x3         // Action Qualifier A Load Select
#define EPWM_AQCTL_LDAQBMODE_S    2
#define EPWM_AQCTL_LDAQBMODE_M    0xC         // Action Qualifier B Load Select
#define EPWM_AQCTL_SHDWAQAMODE    0x10        // Action Qualifer A Operating
                                              // Mode
#define EPWM_AQCTL_SHDWAQBMODE    0x40        // Action Qualifier B Operating
                                              // Mode
#define EPWM_AQCTL_LDAQASYNC_S    8
#define EPWM_AQCTL_LDAQASYNC_M    0x300       // AQCTLA Register Load on SYNC
#define EPWM_AQCTL_LDAQBSYNC_S    10
#define EPWM_AQCTL_LDAQBSYNC_M    0xC00       // AQCTLB Register Load on SYNC

//*****************************************************************************
//
// The following are defines for the bit fields in the AQTSRCSEL register
//
//*****************************************************************************
#define EPWM_AQTSRCSEL_T1SEL_S    0
#define EPWM_AQTSRCSEL_T1SEL_M    0xF         // T1 Event Source Select Bits
#define EPWM_AQTSRCSEL_T2SEL_S    4
#define EPWM_AQTSRCSEL_T2SEL_M    0xF0        // T2 Event Source Select Bits

//*****************************************************************************
//
// The following are defines for the bit fields in the PCCTL register
//
//*****************************************************************************
#define EPWM_PCCTL_CHPEN          0x1         // PWM chopping enable
#define EPWM_PCCTL_OSHTWTH_S      1
#define EPWM_PCCTL_OSHTWTH_M      0x1E        // One-shot pulse width
#define EPWM_PCCTL_CHPFREQ_S      5
#define EPWM_PCCTL_CHPFREQ_M      0xE0        // Chopping clock frequency
#define EPWM_PCCTL_CHPDUTY_S      8
#define EPWM_PCCTL_CHPDUTY_M      0x700       // Chopping clock Duty cycle

//*****************************************************************************
//
// The following are defines for the bit fields in the HRCNFG register
//
//*****************************************************************************
#define EPWM_HRCNFG_EDGMODE_S     0
#define EPWM_HRCNFG_EDGMODE_M     0x3         // ePWMxA Edge Mode Select Bits
#define EPWM_HRCNFG_CTLMODE       0x4         // ePWMxA Control Mode Select Bits
#define EPWM_HRCNFG_HRLOAD_S      3
#define EPWM_HRCNFG_HRLOAD_M      0x18        // ePWMxA Shadow Mode Select Bits
#define EPWM_HRCNFG_SELOUTB       0x20        // EPWMB Output Selection Bit
#define EPWM_HRCNFG_AUTOCONV      0x40        // Autoconversion Bit
#define EPWM_HRCNFG_SWAPAB        0x80        // Swap EPWMA and EPWMB Outputs
                                              // Bit
#define EPWM_HRCNFG_EDGMODEB_S    8
#define EPWM_HRCNFG_EDGMODEB_M    0x300       // ePWMxB Edge Mode Select Bits
#define EPWM_HRCNFG_CTLMODEB      0x400       // ePWMxB Control Mode Select Bits
#define EPWM_HRCNFG_HRLOADB_S     11
#define EPWM_HRCNFG_HRLOADB_M     0x1800      // ePWMxB Shadow Mode Select Bits

//*****************************************************************************
//
// The following are defines for the bit fields in the HRPWR register
//
//*****************************************************************************
#define EPWM_HRPWR_CALPWRON       0x8000      // Calibration Power On

//*****************************************************************************
//
// The following are defines for the bit fields in the HRMSTEP register
//
//*****************************************************************************
#define EPWM_HRMSTEP_HRMSTEP_S    0
#define EPWM_HRMSTEP_HRMSTEP_M    0xFF        // High Resolution Micro Step
                                              // Value

//*****************************************************************************
//
// The following are defines for the bit fields in the HRPCTL register
//
//*****************************************************************************
#define EPWM_HRPCTL_HRPE          0x1         // High Resolution Period Enable
#define EPWM_HRPCTL_TBPHSHRLOADE  0x4         // TBPHSHR Load Enable
#define EPWM_HRPCTL_PWMSYNCSELX_S  4
#define EPWM_HRPCTL_PWMSYNCSELX_M  0x70        // PWMSYNCX Source Select Bit:

//*****************************************************************************
//
// The following are defines for the bit fields in the GLDCTL register
//
//*****************************************************************************
#define EPWM_GLDCTL_GLD           0x1         // Global Shadow to Active load
                                              // event control
#define EPWM_GLDCTL_GLDMODE_S     1
#define EPWM_GLDCTL_GLDMODE_M     0x1E        // Shadow to Active Global Load
                                              // Pulse Selection
#define EPWM_GLDCTL_OSHTMODE      0x20        // One Shot Load mode control bit
#define EPWM_GLDCTL_GLDPRD_S      7
#define EPWM_GLDCTL_GLDPRD_M      0x380       // Global Reload Strobe Period
                                              // Select Register
#define EPWM_GLDCTL_GLDCNT_S      10
#define EPWM_GLDCTL_GLDCNT_M      0x1C00      // Global Reload Strobe Counter
                                              // Register

