AdrianoRuseler/LAUNCHXL-F28379D/C2000Ware/common/deprecated/inc/hw_epwm.h
//*****************************************************************************
//
// The following are defines for the bit fields in the GLDCFG register
//
//*****************************************************************************
#define EPWM_GLDCFG_TBPRD_TBPRDHR  0x1         // Global load event configuration
                                              // for TBPRD:TBPRDHR
#define EPWM_GLDCFG_CMPA_CMPAHR   0x2         // Global load event configuration
                                              // for CMPA:CMPAHR
#define EPWM_GLDCFG_CMPB_CMPBHR   0x4         // Global load event configuration
                                              // for CMPB:CMPBHR
#define EPWM_GLDCFG_CMPC          0x8         // Global load event configuration
                                              // for CMPC
#define EPWM_GLDCFG_CMPD          0x10        // Global load event configuration
                                              // for CMPD
#define EPWM_GLDCFG_DBRED_DBREDHR  0x20        // Global load event configuration
                                              // for DBRED:DBREDHR
#define EPWM_GLDCFG_DBFED_DBFEDHR  0x40        // Global load event configuration
                                              // for DBFED:DBFEDHR
#define EPWM_GLDCFG_DBCTL         0x80        // Global load event configuration
                                              // for DBCTL
#define EPWM_GLDCFG_AQCTLA_AQCTLA2  0x100       // Global load event configuration
                                              // for AQCTLA/A2
#define EPWM_GLDCFG_AQCTLB_AQCTLB2  0x200       // Global load event configuration
                                              // for AQCTLB/B2
#define EPWM_GLDCFG_AQCSFRC       0x400       // Global load event configuration
                                              // for AQCSFRC

//*****************************************************************************
//
// The following are defines for the bit fields in the EPWMXLINK register
//
//*****************************************************************************
#define EPWM_XLINK_TBPRDLINK_S    0
#define EPWM_XLINK_TBPRDLINK_M    0xF         // TBPRD:TBPRDHR  Link
#define EPWM_XLINK_CMPALINK_S     4
#define EPWM_XLINK_CMPALINK_M     0xF0        // CMPA:CMPAHR Link
#define EPWM_XLINK_CMPBLINK_S     8
#define EPWM_XLINK_CMPBLINK_M     0xF00       // CMPB:CMPBHR Link
#define EPWM_XLINK_CMPCLINK_S     12
#define EPWM_XLINK_CMPCLINK_M     0xF000      // CMPC Link
#define EPWM_XLINK_CMPDLINK_S     16
#define EPWM_XLINK_CMPDLINK_M     0xF0000     // CMPD Link
#define EPWM_XLINK_GLDCTL2LINK_S  28
#define EPWM_XLINK_GLDCTL2LINK_M  0xF0000000  // GLDCTL2 Link

//*****************************************************************************
//
// The following are defines for the bit fields in the AQCTLA register
//
//*****************************************************************************
#define EPWM_AQCTLA_ZRO_S         0
#define EPWM_AQCTLA_ZRO_M         0x3         // Action Counter = Zero
#define EPWM_AQCTLA_PRD_S         2
#define EPWM_AQCTLA_PRD_M         0xC         // Action Counter = Period
#define EPWM_AQCTLA_CAU_S         4
#define EPWM_AQCTLA_CAU_M         0x30        // Action Counter = Compare A Up
#define EPWM_AQCTLA_CAD_S         6
#define EPWM_AQCTLA_CAD_M         0xC0        // Action Counter = Compare A Down
#define EPWM_AQCTLA_CBU_S         8
#define EPWM_AQCTLA_CBU_M         0x300       // Action Counter = Compare B Up
#define EPWM_AQCTLA_CBD_S         10
#define EPWM_AQCTLA_CBD_M         0xC00       // Action Counter = Compare B Down

//*****************************************************************************
//
// The following are defines for the bit fields in the AQCTLA2 register
//
//*****************************************************************************
#define EPWM_AQCTLA2_T1U_S        0
#define EPWM_AQCTLA2_T1U_M        0x3         // Action when event occurs on T1
                                              // in UP-Count
#define EPWM_AQCTLA2_T1D_S        2
#define EPWM_AQCTLA2_T1D_M        0xC         // Action when event occurs on T1
                                              // in DOWN-Count
#define EPWM_AQCTLA2_T2U_S        4
#define EPWM_AQCTLA2_T2U_M        0x30        // Action when event occurs on T2
                                              // in UP-Count
#define EPWM_AQCTLA2_T2D_S        6
#define EPWM_AQCTLA2_T2D_M        0xC0        // Action when event occurs on T2
                                              // in DOWN-Count

//*****************************************************************************
//
// The following are defines for the bit fields in the AQCTLB register
//
//*****************************************************************************
#define EPWM_AQCTLB_ZRO_S         0
#define EPWM_AQCTLB_ZRO_M         0x3         // Action Counter = Zero
#define EPWM_AQCTLB_PRD_S         2
#define EPWM_AQCTLB_PRD_M         0xC         // Action Counter = Period
#define EPWM_AQCTLB_CAU_S         4
#define EPWM_AQCTLB_CAU_M         0x30        // Action Counter = Compare A Up
#define EPWM_AQCTLB_CAD_S         6
#define EPWM_AQCTLB_CAD_M         0xC0        // Action Counter = Compare A Down
#define EPWM_AQCTLB_CBU_S         8
#define EPWM_AQCTLB_CBU_M         0x300       // Action Counter = Compare B Up
#define EPWM_AQCTLB_CBD_S         10
#define EPWM_AQCTLB_CBD_M         0xC00       // Action Counter = Compare B Down

//*****************************************************************************
//
// The following are defines for the bit fields in the AQCTLB2 register
//
//*****************************************************************************
#define EPWM_AQCTLB2_T1U_S        0
#define EPWM_AQCTLB2_T1U_M        0x3         // Action when event occurs on T1
                                              // in UP-Count
#define EPWM_AQCTLB2_T1D_S        2
#define EPWM_AQCTLB2_T1D_M        0xC         // Action when event occurs on T1
                                              // in DOWN-Count
#define EPWM_AQCTLB2_T2U_S        4
#define EPWM_AQCTLB2_T2U_M        0x30        // Action when event occurs on T2
                                              // in UP-Count
#define EPWM_AQCTLB2_T2D_S        6
#define EPWM_AQCTLB2_T2D_M        0xC0        // Action when event occurs on T2
                                              // in DOWN-Count

//*****************************************************************************
//
// The following are defines for the bit fields in the AQSFRC register
//
//*****************************************************************************
#define EPWM_AQSFRC_ACTSFA_S      0
#define EPWM_AQSFRC_ACTSFA_M      0x3         // Action when One-time SW Force A
                                              // Invoked
#define EPWM_AQSFRC_OTSFA         0x4         // One-time SW Force A Output
#define EPWM_AQSFRC_ACTSFB_S      3
#define EPWM_AQSFRC_ACTSFB_M      0x18        // Action when One-time SW Force B
                                              // Invoked
#define EPWM_AQSFRC_OTSFB         0x20        // One-time SW Force A Output
#define EPWM_AQSFRC_RLDCSF_S      6
#define EPWM_AQSFRC_RLDCSF_M      0xC0        // Reload from Shadow Options

//*****************************************************************************
//
// The following are defines for the bit fields in the AQCSFRC register
//
//*****************************************************************************
#define EPWM_AQCSFRC_CSFA_S       0
#define EPWM_AQCSFRC_CSFA_M       0x3         // Continuous Software Force on
                                              // output A
#define EPWM_AQCSFRC_CSFB_S       2
#define EPWM_AQCSFRC_CSFB_M       0xC         // Continuous Software Force on
                                              // output B

//*****************************************************************************
//
// The following are defines for the bit fields in the DBREDHR register
//
//*****************************************************************************
#define EPWM_DBREDHR_DBREDHR_S    9
#define EPWM_DBREDHR_DBREDHR_M    0xFE00      // DBREDHR High Resolution Bits

//*****************************************************************************
//
// The following are defines for the bit fields in the DBRED register
//
//*****************************************************************************
#define EPWM_DBRED_DBRED_S        0
#define EPWM_DBRED_DBRED_M        0xFFFF      // Rising edge delay value

//*****************************************************************************
//
// The following are defines for the bit fields in the DBFEDHR register
//
//*****************************************************************************
#define EPWM_DBFEDHR_DBFEDHR_S    9
#define EPWM_DBFEDHR_DBFEDHR_M    0xFE00      // DBFEDHR High Resolution Bits

//*****************************************************************************
//
// The following are defines for the bit fields in the DBFED register
//
//*****************************************************************************
#define EPWM_DBFED_DBFED_S        0
#define EPWM_DBFED_DBFED_M        0xFFFF      // Falling edge delay value

//*****************************************************************************
//
// The following are defines for the bit fields in the TBPHS register
//
//*****************************************************************************
#define EPWM_TBPHS_TBPHSHR_S      0
#define EPWM_TBPHS_TBPHSHR_M      0xFFFF      // Extension Register for HRPWM
                                              // Phase (8-bits)
#define EPWM_TBPHS_TBPHS_S        16
#define EPWM_TBPHS_TBPHS_M        0xFFFF0000  // Phase Offset Register

//*****************************************************************************
//
// The following are defines for the bit fields in the TBPRDHR register
//
//*****************************************************************************
#define EPWM_TBPRDHR_TBPRDHR_S    0
#define EPWM_TBPRDHR_TBPRDHR_M    0xFFFF      // High res Time base period
                                              // register

//*****************************************************************************
//
// The following are defines for the bit fields in the TBPRD register
//
//*****************************************************************************
#define EPWM_TBPRD_TBPRD_S        0
#define EPWM_TBPRD_TBPRD_M        0xFFFF      // Time base period register

//*****************************************************************************
//
// The following are defines for the bit fields in the CMPA register
//
//*****************************************************************************
#define EPWM_CMPA_CMPAHR_S        0
#define EPWM_CMPA_CMPAHR_M        0xFFFF      // Compare A HRPWM Extension
                                              // Register
#define EPWM_CMPA_CMPA_S          16
#define EPWM_CMPA_CMPA_M          0xFFFF0000  // Compare A Register

//*****************************************************************************
//
// The following are defines for the bit fields in the CMPB register
//
//*****************************************************************************
#define EPWM_CMPB_CMPB_S          16
#define EPWM_CMPB_CMPB_M          0xFFFF0000  // Compare B Register

//*****************************************************************************
//
// The following are defines for the bit fields in the CMPC register
//
//*****************************************************************************
#define EPWM_CMPC_CMPC_S          0
#define EPWM_CMPC_CMPC_M          0xFFFF      // Compare C Register

//*****************************************************************************
//
// The following are defines for the bit fields in the CMPD register
//
//*****************************************************************************
#define EPWM_CMPD_CMPD_S          0
#define EPWM_CMPD_CMPD_M          0xFFFF      // Compare D Register

//*****************************************************************************
//
// The following are defines for the bit fields in the GLDCTL2 register
//
//*****************************************************************************
#define EPWM_GLDCTL2_OSHTLD       0x1         // Enable reload event in one shot
                                              // mode
#define EPWM_GLDCTL2_GFRCLD       0x2         // Force reload event in one shot
                                              // mode

//*****************************************************************************
//
// The following are defines for the bit fields in the TZSEL register
//
//*****************************************************************************
#define EPWM_TZSEL_CBC1           0x1         // TZ1 CBC select
#define EPWM_TZSEL_CBC2           0x2         // TZ2 CBC select
#define EPWM_TZSEL_CBC3           0x4         // TZ3 CBC select
#define EPWM_TZSEL_CBC4           0x8         // TZ4 CBC select
#define EPWM_TZSEL_CBC5           0x10        // TZ5 CBC select
#define EPWM_TZSEL_CBC6           0x20        // TZ6 CBC select
#define EPWM_TZSEL_DCAEVT2        0x40        // DCAEVT2 CBC select
#define EPWM_TZSEL_DCBEVT2        0x80        // DCBEVT2 CBC select
#define EPWM_TZSEL_OSHT1          0x100       // One-shot TZ1 select
#define EPWM_TZSEL_OSHT2          0x200       // One-shot TZ2 select
#define EPWM_TZSEL_OSHT3          0x400       // One-shot TZ3 select
#define EPWM_TZSEL_OSHT4          0x800       // One-shot TZ4 select
#define EPWM_TZSEL_OSHT5          0x1000      // One-shot TZ5 select
#define EPWM_TZSEL_OSHT6          0x2000      // One-shot TZ6 select
#define EPWM_TZSEL_DCAEVT1        0x4000      // One-shot DCAEVT1 select
#define EPWM_TZSEL_DCBEVT1        0x8000      // One-shot DCBEVT1 select

//*****************************************************************************
//
// The following are defines for the bit fields in the TZDCSEL register
//
//*****************************************************************************
#define EPWM_TZDCSEL_DCAEVT1_S    0
#define EPWM_TZDCSEL_DCAEVT1_M    0x7         // Digital Compare Output A Event
                                              // 1
#define EPWM_TZDCSEL_DCAEVT2_S    3
#define EPWM_TZDCSEL_DCAEVT2_M    0x38        // Digital Compare Output A Event
                                              // 2
#define EPWM_TZDCSEL_DCBEVT1_S    6
#define EPWM_TZDCSEL_DCBEVT1_M    0x1C0       // Digital Compare Output B Event
                                              // 1
#define EPWM_TZDCSEL_DCBEVT2_S    9
#define EPWM_TZDCSEL_DCBEVT2_M    0xE00       // Digital Compare Output B Event
                                              // 2

//*****************************************************************************
//
// The following are defines for the bit fields in the TZCTL register
//
//*****************************************************************************
#define EPWM_TZCTL_TZA_S          0
#define EPWM_TZCTL_TZA_M          0x3         // TZ1 to TZ6 Trip Action On
                                              // EPWMxA
#define EPWM_TZCTL_TZB_S          2
#define EPWM_TZCTL_TZB_M          0xC         // TZ1 to TZ6 Trip Action On
                                              // EPWMxB
#define EPWM_TZCTL_DCAEVT1_S      4
#define EPWM_TZCTL_DCAEVT1_M      0x30        // EPWMxA action on DCAEVT1
#define EPWM_TZCTL_DCAEVT2_S      6
#define EPWM_TZCTL_DCAEVT2_M      0xC0        // EPWMxA action on DCAEVT2
#define EPWM_TZCTL_DCBEVT1_S      8
#define EPWM_TZCTL_DCBEVT1_M      0x300       // EPWMxB action on DCBEVT1
#define EPWM_TZCTL_DCBEVT2_S      10
#define EPWM_TZCTL_DCBEVT2_M      0xC00       // EPWMxB action on DCBEVT2

//*****************************************************************************
//
// The following are defines for the bit fields in the TZCTL2 register
//
//*****************************************************************************
#define EPWM_TZCTL2_TZAU_S        0
#define EPWM_TZCTL2_TZAU_M        0x7         // Trip Action On EPWMxA while
                                              // Count direction is UP
#define EPWM_TZCTL2_TZAD_S        3
#define EPWM_TZCTL2_TZAD_M        0x38        // Trip Action On EPWMxA while
                                              // Count direction is DOWN
#define EPWM_TZCTL2_TZBU_S        6
#define EPWM_TZCTL2_TZBU_M        0x1C0       // Trip Action On EPWMxB while
                                              // Count direction is UP
#define EPWM_TZCTL2_TZBD_S        9
#define EPWM_TZCTL2_TZBD_M        0xE00       // Trip Action On EPWMxB while
                                              // Count direction is DOWN
#define EPWM_TZCTL2_ETZE          0x8000      // TZCTL2 Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the TZCTLDCA register
//
//*****************************************************************************
#define EPWM_TZCTLDCA_DCAEVT1U_S  0
#define EPWM_TZCTLDCA_DCAEVT1U_M  0x7         // DCAEVT1 Action On EPWMxA while
                                              // Count direction is UP
#define EPWM_TZCTLDCA_DCAEVT1D_S  3
#define EPWM_TZCTLDCA_DCAEVT1D_M  0x38        // DCAEVT1 Action On EPWMxA while
                                              // Count direction is DOWN
#define EPWM_TZCTLDCA_DCAEVT2U_S  6
#define EPWM_TZCTLDCA_DCAEVT2U_M  0x1C0       // DCAEVT2 Action On EPWMxA while
                                              // Count direction is UP
#define EPWM_TZCTLDCA_DCAEVT2D_S  9
#define EPWM_TZCTLDCA_DCAEVT2D_M  0xE00       // DCAEVT2 Action On EPWMxA while
                                              // Count direction is DOWN

//*****************************************************************************
//
// The following are defines for the bit fields in the TZCTLDCB register
//
//*****************************************************************************
#define EPWM_TZCTLDCB_DCBEVT1U_S  0
#define EPWM_TZCTLDCB_DCBEVT1U_M  0x7         // DCBEVT1 Action On EPWMxA while
                                              // Count direction is UP
#define EPWM_TZCTLDCB_DCBEVT1D_S  3
#define EPWM_TZCTLDCB_DCBEVT1D_M  0x38        // DCBEVT1 Action On EPWMxA while
                                              // Count direction is DOWN
#define EPWM_TZCTLDCB_DCBEVT2U_S  6
#define EPWM_TZCTLDCB_DCBEVT2U_M  0x1C0       // DCBEVT2 Action On EPWMxA while
                                              // Count direction is UP
#define EPWM_TZCTLDCB_DCBEVT2D_S  9
#define EPWM_TZCTLDCB_DCBEVT2D_M  0xE00       // DCBEVT2 Action On EPWMxA while
                                              // Count direction is DOWN

//*****************************************************************************
//
// The following are defines for the bit fields in the TZEINT register
//
//*****************************************************************************
#define EPWM_TZEINT_CBC           0x2         // Trip Zones Cycle By Cycle Int
                                              // Enable
#define EPWM_TZEINT_OST           0x4         // Trip Zones One Shot Int Enable
#define EPWM_TZEINT_DCAEVT1       0x8         // Digital Compare A Event 1 Int
                                              // Enable
#define EPWM_TZEINT_DCAEVT2       0x10        // Digital Compare A Event 2 Int
                                              // Enable
#define EPWM_TZEINT_DCBEVT1       0x20        // Digital Compare B Event 1 Int
                                              // Enable
#define EPWM_TZEINT_DCBEVT2       0x40        // Digital Compare B Event 2 Int
                                              // Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the TZFLG register
//
//*****************************************************************************
#define EPWM_TZFLG_INT            0x1         // Global Int Status Flag
#define EPWM_TZFLG_CBC            0x2         // Trip Zones Cycle By Cycle Flag
#define EPWM_TZFLG_OST            0x4         // Trip Zones One Shot Flag
#define EPWM_TZFLG_DCAEVT1        0x8         // Digital Compare A Event 1 Flag
#define EPWM_TZFLG_DCAEVT2        0x10        // Digital Compare A Event 2 Flag
#define EPWM_TZFLG_DCBEVT1        0x20        // Digital Compare B Event 1 Flag
#define EPWM_TZFLG_DCBEVT2        0x40        // Digital Compare B Event 2 Flag

//*****************************************************************************
//
// The following are defines for the bit fields in the TZCBCFLG register
//
//*****************************************************************************
#define EPWM_TZCBCFLG_CBC1        0x1         // Latched Status Flag for CBC1
                                              // Trip Latch
#define EPWM_TZCBCFLG_CBC2        0x2         // Latched Status Flag for CBC2
                                              // Trip Latch
#define EPWM_TZCBCFLG_CBC3        0x4         // Latched Status Flag for CBC3
                                              // Trip Latch
#define EPWM_TZCBCFLG_CBC4        0x8         // Latched Status Flag for CBC4
                                              // Trip Latch
#define EPWM_TZCBCFLG_CBC5        0x10        // Latched Status Flag for CBC5
                                              // Trip Latch
#define EPWM_TZCBCFLG_CBC6        0x20        // Latched Status Flag for CBC6
                                              // Trip Latch
#define EPWM_TZCBCFLG_DCAEVT2     0x40        // Latched Status Flag for Digital
                                              // Compare Output A Event 2
#define EPWM_TZCBCFLG_DCBEVT2     0x80        // Latched Status Flag for Digital
                                              // Compare Output B Event 2

//*****************************************************************************
//
// The following are defines for the bit fields in the TZOSTFLG register
//
//*****************************************************************************
#define EPWM_TZOSTFLG_OST1        0x1         // Latched Status Flag for OST1
                                              // Trip Latch
#define EPWM_TZOSTFLG_OST2        0x2         // Latched Status Flag for OST2
                                              // Trip Latch
#define EPWM_TZOSTFLG_OST3        0x4         // Latched Status Flag for OST3
                                              // Trip Latch
#define EPWM_TZOSTFLG_OST4        0x8         // Latched Status Flag for OST4
                                              // Trip Latch
#define EPWM_TZOSTFLG_OST5        0x10        // Latched Status Flag for OST5
                                              // Trip Latch
#define EPWM_TZOSTFLG_OST6        0x20        // Latched Status Flag for OST6
                                              // Trip Latch
#define EPWM_TZOSTFLG_DCAEVT2     0x40        // Latched Status Flag for Digital
                                              // Compare Output A Event 1
#define EPWM_TZOSTFLG_DCBEVT2     0x80        // Latched Status Flag for Digital
                                              // Compare Output B Event 1

